; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	spectrograph1 - mode
	infrared2 - mode
	spectrograph3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Planet7 spectrograph1)
	(have_image Planet8 image0)
	(have_image Planet9 spectrograph3)
	(have_image Star10 spectrograph3)
	(have_image Planet11 spectrograph3)
	(have_image Star12 spectrograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 star12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star12)
   goals met: 0 of 6
4. (take_image satellite0 star12 instrument1 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 1 of 6
5. (turn_to satellite0 planet8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet8)
   goals met: 1 of 6
6. (take_image satellite0 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 2 of 6
7. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 2 of 6
8. (take_image satellite0 planet7 instrument1 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 3 of 6
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 6
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 6
11. (turn_to satellite0 star3 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star3)
   goals met: 3 of 6
12. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 3 of 6
13. (turn_to satellite0 planet11 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet11)
   goals met: 3 of 6
14. (take_image satellite0 planet11 instrument0 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 4 of 6
15. (turn_to satellite0 planet9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet9)
   goals met: 4 of 6
16. (take_image satellite0 planet9 instrument0 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 5 of 6
17. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 5 of 6
18. (take_image satellite0 star10 instrument0 spectrograph3)
   added: (have_image star10 spectrograph3)
   goals met: 6 of 6
